Catalogs/ЗональныеКоэффициентыНИ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ЗональныеКоэффициентыНИ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/КоэфицентыНалогаНаИмущество.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>КоэфицентыНалогаНаИмущество</Name>
			<InformationRegisterPeriodicity>Year</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Коэфициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Классификация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегиональныеКоэффициентыНИ</v8:Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОтраслевойПринадлежностиНИ</v8:Type>
						<v8:Type>cfg:CatalogRef.ЗональныеКоэффициентыНИ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ЗональныеКоэффициентыНИ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Процедура - Заполнить по умолчанию
// Выполняет первоночальное заполнение
Процедура ЗаполнитьПоУмолчанию() Экспорт 
	СправочникСсылка = Справочники.ЗональныеКоэффициентыНИ.ОсновнаяЗона;
	СправочникОбъект = СправочникСсылка.ПолучитьОбъект();
	СправочникОбъект.Коэффициент = 1;       

	БухгалтерскийУчетКлиентСервер.ЗаписатьСправочникОбъект(СправочникОбъект);
		
	ПериодНабораЗаписей = НачалоГода(ТекущаяДатаСеанса());
	
	НаборЗаписей = РегистрыСведений.КоэфицентыНалогаНаИмущество.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(ПериодНабораЗаписей);
	НаборЗаписей.Отбор.Классификация.Установить(СправочникСсылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить(); 
	
	ЗаписьНабораЗаписей = НаборЗаписей.Добавить();
	ЗаписьНабораЗаписей.Период = КонецГода(ПериодНабораЗаписей);
	ЗаписьНабораЗаписей.Классификация = СправочникСсылка;
	ЗаписьНабораЗаписей.Коэфициент = 1;
		
	Попытка
		НаборЗаписей.Записать(); 	
	Исключение
	КонецПопытки; 
КонецПроцедуры // ЗаполнитьПоУмолчанию()	

#КонецОбласти
	
#КонецЕсли
